 
                                  Toets code in
§1                    START  F1:
HAPPY HOUR §1:§2         EINDE F1:
HAPPY HOUR §1:§2          START  F2:
HAPPY HOUR §1:§2         EINDE F2:
HAPPY HOUR §1:§2          START  F3:
HAPPY HOUR §1:§2         EINDE F3:
HAPPY HOUR §1:§2          Munten      §1  §2
kaart     0=acc. Munten      §1  §2
geen kaart 0=acc Max. kred. kaart
§1                 1=PROGRAMMEREN
2=DATA 3=TESTV.      4=REINIG 6=MODEM
5=ONDERHOUD        1=PROGR  2=DATA
3=TEST   4=REIN.    1=PROGR  2=DATA
3=TEST   4=REIN.    Korting
kaart    -  §1 %            Def. Vibr. mot.
Tijd gr.  §1  §2    FUNCTIONEERT
                       Niet in gebruik
                    PRODUCT  §1
0=uit       §2.§3       DOSERING gram
PRODUCT §1  §2.§3     Uitstel afgifte
PRODUCT §1  §2.§3   aantal pauzes
0-2 15=max   §1       Tijd WATER  §1
0=uit      §2.§3     Uitstel afgifte
WATER §1    §2.§3   MIXER §1
0=uit      §2.§3           Uitstel afgifte
MIXER §1    §2.§3   Water stroom: §1
§2                 Naam selectie §1§2
§3               Uitgifte vertr.
§1.§2               Programmeren:
§1                    MIXER snelheid
§1      §2           Dag van de week
§1.                 SCHAKELT IN:
§1.     §2:§3          SCHAKELT UIT:
§1.     §2:§3         REINIGEN:
§1:§2                     UUR  :
§1:§2                        DAG  :
§1                           MAAND:
§1                           JAAR :
§1                           WATER v. KOFFIE
0=uit    cc: §1     KOFFIE VOLGORDE
1=koffie eerst §1   Verbruik  kWh
§1.§2                 X4 spoelen2 wat.
in zetgr. §1ml     1ste installatie
0=eerste      §1   Niet in gebruik
                    Verse Melk
§1                       VOLTAGE
volt:       §1.§2           TEST MODEM
KNOP 4                   Niet in gebruik
                    PRE-SELECTIE
                       GEEN TOEGANG
----------------       X5 wachttijd 2
wat. zetgr§1.§2s     Def. Vibr. mot.
Snelhd gr. §1 §2    Temperatuur in
display   1=JA §1    X6 wachttijd 3
wat. legen§1.§2s     TOTAAL SELECTIES
§1                 DEEL SELECTIES
§1                   TOTAAL GELD
§1                      DEEL GELD
§1                        TOTAAL TESTS
§1                     DEEL TESTS
§1                       Tot. geladen op
kaart§1 §2          Deel geladen op
kaart§1 §2          Tot. afgeschrev.
kaart§1 §2         Deel afgeschrev.
kaart§1 §2         Tot. geladen op
kaart  §1           Deel geladen op
kaart  §1           Tot. afgeschrev.
kaart  §1          Deel afgeschrev.
kaart  §1          Niet in gebruik
                    Niet in gebruik
                    Niet in gebruik
                    Niet in gebruik
                    Niet in gebruik
                    Niet in gebruik
                    Niet in gebruik
                    Niet in gebruik
                    DEEL §1 SEL.   §2
§3                DEEL SELECTIE §1
§2                 DEEL SELECTIE §1
HAPPY  §2          DEEL SELECTIE §1
GR.KAN §2          MUNTEN §1
§2                        PRIJS  §1
§2                        TEMPERATUUR
Temp. EV1   §1          Extra verwarmen
1e koffie na §1     TEMPERATUUR
Temp. EV2   §1          PL for cash
0=PL1 1=PL2    §1       select. molen 2
1=ja           §1   Niet in gebruik
                    Pre-selectie
BARLEY                 REGISTRATIE-----
-BUITEN GEBRUIK    Selec. herhalen
§1                  Extra verwarmen
in sec.: §1.§2      TEMPERATUUR
Temp. EV3   §1          PROGRAMMEREN----
-KNOP §1--------   PROGRAMMEREN----
-KLOK-----------   PROGRAMMEREN----
PRIJZEN     §1     PROGRAMMEREN----
-PRIJZEN--------   PROGRAMMEREN----
-MUNTEN---------   PROGRAMMEREN----
-TEMPERATUUR----   PROGRAMMEREN----
-DIVERSEN-------   DIAGNOSE--------
----------------   VERKOOP GEGEVENS
----------------   PROGRAMMEREN----
HAPPY PRIJS=§1     PROGRAMMEREN----
-HAPPY PRIJS       PROGRAMMEREN----
PRODUCT HOEVEELH   PROGRAMMEREN----
-ONDERHOUD------   PROGRAMMEREN----
RFID KAART         TEST suikerarm
druk op knop 4       Kies theezakje
0=uit         §1     Aantal cycli
§1                     Tussenpauze
sec:       §1           Cyclische selec.
0=vast         §1  Machine Code
A      §1              Machine Code
B      §1              Bericht nummer
§1                   Munt-mech type
§1                   prog menu
toegangscode §1           Niet in gebruik
                    Lepel    0=voor
1=na          §1    Ventilator tijd
min.        §1      Signaal tijd
§1.§2                  Aantal decimalen
§1                 PL for cashless
0=PL1 1=PL2    §1   Taal:
Nederlands                    Gebruik stopknop
0=nee 1=ja   §1    Vrij
                               TEMPERATUUR
Delta        §1         Niet in gebruik
                    Niet in gebruik
                    Afstel. pomp  §1
§2 §3 %            Afstel. motor §1
§2 §3 %            koffiemolen
seconden    §1.§2       koffiemolen
gram        §1.§2       Afstellen molen
§1 §2 %             Pre-selectie
GEEN SUIKER            TEST MOV. SUIKER
sel 4              Pre-selectie
GEEN SUIKER            Extra melk
hoeveelheid +§1.§2       Latte-Macchiato
START GROEP §1.§2   Niet in gebruik
                    Stroombegrenzing
10A                Niet in gebruik
                    TEMPERATUUR
zetgr.verw:  §1         Niet in gebruik
                    Koffiebonen
[§1.§2]  §3.§4          Water hoeveelh.
ESPRESSO   -§1 %    Container
koffie 2  n:   §1         Koffie 2 prijs
0=+ 1=-       §1     ev-mixer
KOFFIE 2  n:   §1          Activeren presel
knop    §1:§2      Container
SUIKER     n:  §1         X7 spoelen
temperat.  §1            Pre-selectie
ESPRESSO               Lepel
§1                            Pre-selectie
EXTRA SUIKER           PRODUCT
MELK  LM     n:§1           Activeren teller
0=nee 1=ja    §1   Extra suiker
hoeveelheid +§1.§2     Container
BARLEY       n:§1         EV-mixer
BARLEY       n:§1          Prijs BARLEY
0=+ 1=-       §1       n.§1 off §2 §3
§4:§5 §6-§7-20§8     n.§1  NEE
BUITEN GEBRUIK            Lepel
§1                            Bekersensor
1=actief       §1       Vibr.mot.
Tijd gr.     §1           Vibr. mot.
Snelhd gr.   §1          PWM van de Pomp
§1%                 Gratis uitgifte?
0=nee 1=1 2=++ §1  Niet in gebruik
                    Teller residubak
[§1]    §2         Gratis uitgifte?
0=nee 1=1 2=++ §1  Niet in gebruik
                    Niet in gebruik
                    Product hoevh.§1
[§2.§3]  §4.§5     Pre-selectie
KAN                    EV verse melk
§1.§2                 Niet in gebruik
                    Prod. §1 waarschu
grens:    §2.§3   Stop product   §1
1=stop         §2 TOTAAL GRATIS
§1                    DEEL GRATIS
§1                      TOTAAL GELD
GELD   §1               DEEL GELD
GELD   §1                 N. TOT.SEL. GELD
§1                 N. DEEL SEL.GELD
§1                 TOTAAL GELDBAK
§1                   DEEL GELDBAK
§1                     TOT. SEL.KAART §1
§2                DEEL SEL.KAART §1
§2                TOTAAL SEL.KAART
§1                 DEEL SEL. KAART
§1                  Geldbuizen legen
Kn. 4-5-7-8-9-10   Wisselen mogel.
0=aan  1=uit   §1   Max. krediet
§1                     Max. retour
§1                      Type betaalsyst.
0=sing. 1=mult.§1  Waarde token
§1                     wisselen     §1 §2
0=Ja  1=Nee      Munt.niet wis§1 §2
0=ja   1=nee     MDB buis waarde
§1                  Biljet lezer
Aan=  0;1;2  = §1      PROGRAMMEREN----
- MDB ----------   Pre-selectie
EXTRA MELK             Pre-selectie
ESPRESSO               Pre-selectie
SELECTIE 25-36         Pre-selectie
DECAFÉ                 Pre-selectie
Niet in gebruik        Pre-selectie
GEEN BEKER             Pre-selectie
BARLEY                 TEST ZETGROEP
Absorptie  sel4       boiler  cc:
0=400   1=800  §1       Niet in gebruik
                    Snelmenu
Toegangscode §1            EV lucht
verse melk  §1.§2          Niet in gebruik
                    AFSTELLEN
MOTOREN                   Kalibratie groep
druk <PROG> §1     LM EV melk water
Nummer=        §1  Niet in gebruik
                    De-installeren
10=START             TEMPERATUUR
Koffie      §1          Niet in gebruik
                    TEMPERATUUR
Boiler      §1          X8 Sluiten van
de zetgr.   §1%      TEMPERATUUR
Latte Macch.§1          Code   ID 101
§1                    Code   ID 104
§1                    Code   ID 106
§1                    Adres VIDTS
§1                      Protocol
§1                         DataAudit 0=TMON
1=DDCMP 2=DIAG §1  Niet in gebruik
                    PROGRAMMEREN----
-ID. MACHINE       Zomertijd
1=ingeschakeld §1         Niet in gebruik
                    LAGE DRUK
                          X9 wachttijd 3
la. koff. §1 min     X10 min . koff.
hoeveelh.= §1cc     A1 PWM Variflex
beweging  §1%       A2 Pomp AAN tijd
§1.§2[s]           Pre-selectie
SELECTIE 37-48         Pre-selectie
GROTE BEKER            Koffiesensor
1=actief    §1         Niet in gebruik
                    WATER
percentage +§1 %              + of -  PRIJS
0=+  1=-      §1      PRODUCT
percentage +§1 %            Niet in gebruik
                    Niet in gebruik
                    Niet in gebruik
                    Niet in gebruik
                    Niet in gebruik
                    PRE-INFUSIE
0=nee  sec.:§1          KAN
0=nee       n:§1                Pre-selectie
SUIKER                 Pre-selectie
LANG                   Water
LANG       +§1 %              Aantal selecties
Bingo       §1     Prijs met kaart
1=Happy prijs  §1   Druk <PROG> om
laden:  §1           Standaard suiker
Leds: 0-5   =  §1  Niet in gebruik
                    A3 Pomp UIT tijd
§1.§2[s]           A5 druk
nivo        §1              PROGRAMMEREN----
-MDB USD--------   PROGR. MDB USD §1
SEL. 4            PROGR. MDB USD
SEL. 4               Kalibr. motor §1
gr/sec    §2       Product §1 gebr.
deel g.§2          Product §1 gebr.
tot. g.§2          KALIBRATIE
PRODUCTFLUX              PRODUCTGEGEVENS
------FLUX-----     TEST MOTOR
Absorptie  kn.4          Afst. molen   §1
§2 §3 %            Niet in gebruik
                    Activ.H2O filter
Reset  0=nee   §1  Niet in gebruik
                    A6 water na
koffie   §1[ml]         A7 zetkamer
opening    §1%          DA rotatie
0=aut 1=man. §1          stel voorverw.
in van sel. §1       MDB comp. eigen
bkr 0=nee 1=ja§1    Korrelgrootte
§1                    Niet in gebruik
                    pricehold query
no=0 yes=1    §1    Waterpomp extern
0-4           §1   Zetgroepdruk
0=max 10=min. §1       Dubbele koffie
0=nee 1=ja     §1    Sensor lekbak
inschak?  ja=1 §1     Niet in gebruik
                    Pre-selectie
Naam:   §1             Niet in gebruik
                    Bekermaat
§1                        vend payment
timeout §1 sec.        EV verse melk
vertraging  §1.§2     Vertraging lucht
verse melk  §1.§2  Niet in gebruik
                    Niet in gebruik
                    PROGRAMMEREN----
VARIGRIND §1       A7 zetkamer
opening    §1%          PROGRAMMEREN
VERSE MELK UNIT        Beker uitgifte
0=ja  1=nee    §1    Niet in gebruik
                    Niet in gebruik
                    PROGRAMMEREN
VARIGRIND 2            PRESEL. NUM §1§2
§3                 Geverif. gegev.
§1                  Water Flush mode
1=ON 0=OFF §1       
                                  xxxxxx
                             PROGRAMMEREN----
RFID BLACK LIST    Blok. kaart  §1
Nummer      §2      TEST CUP STATION
knop 4             niet in gebruik
                    PROGRAMMEREN
VARIFLEX               PROGRAMMEREN
MICRO                  PROGRAMMEREN
                       TEMPERATUUR
Temp. EV4   §1          Voorselectie
SELECTIES 49-60        xxxxxx
                             xxxxxx
                             Niet in gebruik
                    Tijdstip reinig.
Verse melk §1:§2   VerseMelk<->Topp
omschak. ja=1  §1  Kalibrat.groep 2
druk <PROG> §1     Bekersensor trig
0=dis  §1 - §2     Stel gratis
uit. in uur §1          Inst. data-audit
vooraf  1=ja  §1   Schaalfactor
instant  §1 §2 %       TEST roerstaaf
knop 4               Veiligheidsnivo
nivo 1-4      §1    Kalibr. koffie 3
druk PROG   §1     Kalibr. koffie 4
druk PROG   §1     Herhaal koffie
0=uitgesch.  §1      Huidige taal
§1                     SCHAKELT IN:
§1.     §2:§3          X4 spoelen  2
wat. in ZG §1ml       VOLTAGE
volt:       §1.§2           REGISTRATIE-----
-BUITEN GEBRUIK    Lepel    0=voor
1=na          §1    Aantal decimalen
§1                 Bekersensor
1=actief       §1       ev-mixer
KOFFIE 2  n:   §1          Niet in gebruik
                    aantal pauzes
0-2 12=max   §1       Power adj. pump
0=no 1=yes  §1      